[
  {
    "riddle": "What is black when you buy it, red when you use it, and gray when you throw it away?",
    "answer": "charcoal"
  },
    {
    "riddle": "They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own. What are they?",
    "answer": "gloves"
  },
    {
    "riddle": "Not born, but from a Mother's body drawn, I hang until half of me is gone. I sleep in a cave until I grow old, then valued for my hardened gold. What am I?",
    "answer": "cheese"
  },
    {
    "riddle": "I am not alive, but I grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I?",
    "answer": "fire"
  },
    {
    "riddle": "I cover what's real, hide what is true, but sometimes bring out the courage in you. What am I?",
    "answer": "makeup"
  },
    {
    "riddle": "When you stop and look, you can always see me. If you try to touch you cannot feel me. I cannot move, but as you near me, I will move away from you. What am I?",
    "answer": "horizon"
  },
    {
    "riddle": "I am something people love or hate. I change peoples appearances and thoughts. If a person takes care of them self I will go up even higher. To some people I will fool them. To others I am a mystery. Some people might want to try and hide me but I will show. No matter how hard people try I will Never go down. What am I?",
    "answer": "age"
  },
    {
    "riddle": "I come in many colors and I am very thin, I am found in every country, even in your home, I am very important, you can be very creative with me, I can even help you learn.What am I?",
    "answer": "paper"
  },
    {
    "riddle": "I am two-faced but bear only one, I have no legs but travel widely. Men spill much blood over me, kings leave there imprint on me. I have greatest power when given away, yet lust for me keeps me locked away.What am I?",
    "answer": "coin"
  },
    {
    "riddle": "I can be any color you can imagine. You see me in everyday life. I have been around for many, many years, Look around, you can probably see some of me right now. What am I?",
    "answer": "paint"
  }
]